const books = [{
    'src': '/images/w91/w91-890c58a6.jpg',
    'title': '451° по Фаренгейту',
    'author': 'Рей Брэдбери',
    'description': 'Мастер мирового масштаба, совмещающий в литературе несовместимое. Создатель таких ярчайших шедевров, как "Марсианские хроники", "451° по Фаренгейту", "Вино из одуванчиков" и так далее и так далее. Лауреат многочисленных премий. Это Рэй...',
    'id': 1
}, {
    'src': '/images/w91/w91-f062d9a6.jpg',
    'title': 'Шантарам',
    'author': 'Грегори Дэвид Робертс',
    'description': 'Представляем читателю один из самых поразительных романов начала XXI века (в 2015 году получивший долгожданное продолжение – «Тень горы»). Эта преломленная в художественной форме исповедь человека, который сумел выбраться из бездны и...',
    'id': 2
}, {
    'src': '/images/w91/w91-11c299bd.jpg',
    'title': '1984',
    'author': 'Джордж Оруэлл',
    'description': 'Своеобразный антипод второй великой антиутопии XX века - "О дивный новый мир" Олдоса Хаксли. Что, в сущности, страшнее: доведенное до абсурда "общество потребления" - или доведенное до абсолюта "общество идеи"? По Оруэллу, нет и не может...',
    'id': 3
}, {
    'src': '/images/w91/w91-c922d61d.jpg',
    'title': 'Мастер и Маргарита',
    'author': 'Михаил Афанасьевич Булгаков',
    'description': 'Один из самых загадочных и удивительных романов XX века. Роман "Мастер и Маргарита" - визитная карточка Михаила Афанасьевича Булгакова. Более десяти лет Булгаков работал над книгой, которая стала его романом-судьбой, романом-завещанием. В...',
    'id': 4
}, {
    'src': '/images/w91/w91-6c557afb.jpg',
    'title': 'Три товарища',
    'author': 'Эрих Мария Ремарк',
    'description': 'Трое друзей - Робби, отчаянный автогонщик Кестер и "последний романтик" Ленц прошли Первую мировую войну. Вернувшись в гражданскую жизнь, они основали небольшую автомастерскую. И хотя призраки прошлого преследуют их, они не унывают - ведь...',
    'id': 5
}, {
    'src': '/images/w91/w91-3a2f33e2.jpg',
    'title': 'Портрет Дориана Грея',
    'author': 'Оскар Уайльд',
    'description': '«Портрет Дориана Грея» – одно из величайших произведений последних полутора столетий, роман, который пытались запретить, а автора осуждали за «непристойное поведение». Превращение прекрасного и невинного юноши Дориана в чудовище под...',
    'id': 6
}, {
    'src': '/images/w91/w91-d14620c9.jpg',
    'title': 'Вино из одуванчиков',
    'author': 'Рей Брэдбери',
    'description': 'Войдите в светлый мир двенадцатилетнего мальчика и проживите с ним одно лето, наполненное событиями радостными и печальными, загадочными и тревожными; лето, когда каждый день совершаются удивительные открытия, главное из которых — ты...',
    'id': 7
}, {
    'src': '/images/w91/w91-82ae5eb2.jpg',
    'title': 'Над пропастью во ржи',
    'author': 'Джером Д. Сэлинджер',
    'description': 'Писатель-классик, писатель-загадка, на пике своей карьеры объявивший об уходе из литературы и поселившийся вдали от мирских соблазнов в глухой американской провинции. Единственный роман Сэлинджера, НАД ПРОПАСТЬЮ ВО РЖИ стал переломной...',
    'id': 8
}, {
    'src': '/images/w91/w91-4c85231c.jpg',
    'title': 'Цветы для Элджернона',
    'author': 'Даниел Киз',
    'description': 'Сорок лет назад это считалось фантастикой. Сорок лет назад это читалось как фантастика. Исследующая и расширяющая границы жанра, жадно впитывающая всевозможные новейшие веяния, примеряющая общечеловеческое лицо, отважно игнорирующая...',
    'id': 9
}, {
    'src': '/images/w91/w91-602d8bea.jpg',
    'title': 'Убить пересмешника',
    'author': 'Харпер Ли',
    'description': 'О книге "Убить пересмешника" (1960 г.) - пронзительная история семьи, живущей в вымышленном маленьком городке на юге Америки, в штате Алабама. Время действия - 30-ые годы XX века, период Великой Депрессии. Рассказ ведется от лица...',
    'id': 10
}, {
    'src': '/images/w91/w91-46fb03ce.jpg',
    'title': 'Маленький принц',
    'author': 'Антуан де Сент-Экзюпери',
    'description': '«Маленький принц» — аллегорическая повесть, наиболее известное произведение Антуана де Сент-Экзюпери.\n                                    Рисунки в книге выполнены самим автором и не менее знамениты, чем сама книга. Важно, что это не иллюстрации, а органическая часть...',
    'id': 11
}, {
    'src': '/images/w91/w91-c9166534.jpg',
    'title': 'Атлант расправил плечи',
    'author': 'Айн  Рэнд',
    'description': 'Айн Рэнд - наша бывшая соотечественница, ставшая крупнейшей американской писательницей. Автор четырех романов-бестселлеров и многочислененых статей. Создатель философской концепции, в основе которой лежит принцип свободы воли, главенство...',
    'id': 12
}, {
    'src': '/images/w91/w91-4ad19df1.jpg',
    'title': 'Анна Каренина',
    'author': 'Лев Толстой',
    'description': 'Гениальный роман Льва Толстого, который не оставляет равнодушным никого, кто его прочел. Драма жизни, женская саморазрушающая любовь, поиски себя и становление личности - все в традициях русской классики. \n                                    Красивая, молодая женщина из...',
    'id': 13
}, {
    'src': '/images/w91/w91-13d04cd2.jpg',
    'title': 'Тень горы',
    'author': 'Грегори Дэвид Робертс',
    'description': 'Впервые на русском – долгожданное продолжение одного из самых поразительных романов начала XXI века. \n                                    «Шантарам» – это была преломленная в художественной форме исповедь человека, который сумел выбраться из бездны и уцелеть, разошедшаяся...',
    'id': 14
}, {
    'src': '/images/w91/w91-4d6539a7.jpg',
    'title': 'Сто лет одиночества',
    'author': 'Габриэль Гарсиа Маркес',
    'description': 'Странная, поэтичная, причудливая история города Макондо, затерянного где-то в джунглях, - от сотворения до упадка. История рода Буэндиа - семьи, в которой чудеса столь повседневны, что на них даже не обращают внимания. Клан Буэндиа...',
    'id': 15
}, {
    'src': '/images/w91/w91-54a87185.jpg',
    'title': 'Преступление и наказание',
    'author': 'Федор Михайлович Достоевский',
    'description': 'Ф.М.Достоевский - один из тех немногих писателей, которые повлияли на умы не только современников, но и потомков. В своем творчестве он ставит самые главные, самые трудные - непосильные - вопросы. Роман "Преступление и наказание" -...',
    'id': 16
}, {
    'src': '/images/w91/w91-7d894c5b.jpg',
    'title': 'Триумфальная арка',
    'author': 'Эрих Мария Ремарк',
    'description': 'Один из самых красивых и трагических романов о любви в истории европейской литературы, не единожды экранизированный, до сих пор не утративший ни своего горького обаяния, ни удивительного влияния на эмоции читателей. История беженца из...',
    'id': 17
}, {
    'src': '/images/w91/w91-e138ee7c.jpg',
    'title': 'Граф Монте-Кристо',
    'author': 'Александр Дюма',
    'description': '"Граф Монте-Кристо"- книга, которую вот уже полтора столетия с увлечением читают и взрослые, и дети. Это история о том, как невинно осужденный моряк стал сказочно богатым графом и о том, как он вознаградил своих верных друзей и отомстил...',
    'id': 18
}, {
    'src': '/images/w91/w91-3d137c16.jpg',
    'title': 'Бойцовский клуб',
    'author': 'Чак Паланик',
    'description': 'Это — самая потрясающая и самая скандальная книга 1990-х. Книга, в которой устами Чака Паланика заговорило не просто "Поколение Икс", но — "Поколение Икс" уже озлобленное, уже растерявшее свои последние иллюзии. Вы смотрели фильм...',
    'id': 19
}, {
    'src': '/images/w91/w91-807eec7e.jpg',
    'title': 'Марсианин',
    'author': 'Энди Вейер',
    'description': 'Энди Вейр (Andy Weir) с пятнадцати лет и до сих пор работает инженером-программистом. Увлекается изучением релятивистской физики, орбитальной механики, истории пилотируемой космонавтики. "Марсианин" - его первый роман. Обстоятельства...',
    'id': 20
}, {
    'src': '/images/w91/w91-7cef86b0.jpg',
    'title': 'Двенадцать стульев',
    'author': 'Евгений Петров',
    'description': 'Знаменитый роман-фельетон И.Ильфа и Е.Петрова «Двенадцать стульев» впервые был опубликован в 1928 году, а сегодня его называют в числе культовых произведений отечественной литературы XX века. История двух аферистов, пустившихся на поиски...',
    'id': 21
}, {
    'src': '/images/w91/w91-ee5ad637.jpg',
    'title': 'Мне тебя обещали',
    'author': 'Эльчин Сафарли',
    'description': '"Это я. Скрываться и врать, что это всего лишь образ, смешно. Вместил в эту историю непростой период своей жизни, когда время отняло меня у меня же. Говорить об утрате больно. Лучше о ней написать. Я попробовал, и сам не заметил, как...',
    'id': 22
}, {
    'src': '/images/w91/w91-5618b631.jpg',
    'title': 'Книжный вор',
    'author': 'Маркус Зусак',
    'description': 'Январь 1939 года. Германия. Страна, затаившая дыхание. Никогда еще у смерти не было столько работы. А будет еще больше. \n                                    Мать везет девятилетнюю Лизель Мемингер и ее младшего брата к приемным родителям под Мюнхен, потому что их отца...',
    'id': 23
}, {
    'src': '/images/w91/w91-87302039.jpg',
    'title': 'Одиночество в Сети',
    'author': 'Януш Леон Вишневский',
    'description': 'Один из самых пронзительных романов о любви, вышедших в России в последнее время. "Из всего, что вечно, самый краткий срок у любви" - таков лейтмотив европейского бестселлера Я.Л.Вишневского. Герои "Одиночества в Сети" встречаются в...',
    'id': 24
}, {
    'src': '/images/w91/w91-f1aba036.jpg',
    'title': 'Дом, в котором…',
    'author': 'Мариам Петросян',
    'description': 'На окраине города, среди стандартных новостроек, стоит Серый Дом, в котором живут Сфинкс, Слепой, Лорд, Табаки, Македонский, Черный и многие другие. Неизвестно, действительно ли Лорд происходит из благородного рода драконов, но вот Слепой...',
    'id': 25
}, {
    'src': '/images/w91/w91-e2af3331.jpg',
    'title': 'Алхимик',
    'author': 'Пауло  Коэльо',
    'description': 'Эта удивительная книга Пауло Коэльо вдохновляет читателей во всем мире. В этой истории, сочетающей в себе простоту силы и вдохновение мудрости, повествуется о юном пастухе из Андалузии по имени Сантьяго. Он покидает родную Испанию и...',
    'id': 26
}, {
    'src': '/images/w91/w91-4f0217de.jpg',
    'title': 'Великий Гэтсби',
    'author': 'Фрэнсис Скотт Фицджеральд',
    'description': '"Великий Гэтсби" - вершина не только в творчестве Ф. С. Фицджеральда, но и одно из высших достижений в мировой прозе XX века. Хотя действие романа происходит в "бурные" двадцатые годы прошлого столетия, когда состояния делались буквально...',
    'id': 27
}, {
    'src': '/images/w91/w91-d5677caf.jpg',
    'title': 'Идиот',
    'author': 'Федор Михайлович Достоевский',
    'description': 'Роман «Идиот» занимает в творчестве Достоевского особое место. В центре других его произведений стоят трагические образы мятежных героев — «отрицателей». В «Идиоте» же писатель избрал своим главным героем, по собственному определению,...',
    'id': 28
}, {
    'src': '/images/w91/w91-1bdd71d5.jpg',
    'title': 'Евгений Онегин',
    'author': 'Александр Сергеевич Пушкин',
    'description': '«Евгений Онегин» — роман в стихах Александра Сергеевича Пушкина, написанный в 1823—1831 годах, одно из самых значительных произведений русской словесности. Пушкин работал над этим романом свыше семи лет.\n                                    На широком фоне картин русской...',
    'id': 29
}, {
    'src': '/images/w91/w91-1ebc669f.jpg',
    'title': 'Герой нашего времени',
    'author': 'Михаил Юрьевич Лермонтов',
    'description': '«Героой наашего времени» (написан в 1838—1840) — знаменитый роман Михаила Юрьевича Лермонтова, классика русской литературы. Роман состоит из нескольких частей, хронологический порядок которых нарушен. \n                                    Образ Печорина — одно из...',
    'id': 30
}, {
    'src': '/images/w91/w91-18894686.jpg',
    'title': 'Бесы',
    'author': 'Федор Михайлович Достоевский',
    'description': 'БЕСЫ - безусловно, роман-предостережение и роман-пророечество, в котором великий писатель и мыслитель указывает на грядущие социальные катастрофы. История подтвердила правоту писателя, и неоденократно. Кровавая русская революция,...',
    'id': 31
}, {
    'src': '/images/w91/w91-c7ab4141.jpg',
    'title': 'Гордость и предубеждение',
    'author': 'Джейн Остен',
    'description': 'Широко известный роман Д.Остен. \n                                    Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. И потому размеренная жизнь солидного семейства переворачивается вверх дном, когда по соседству...',
    'id': 32
}, {
    'src': '/images/w91/w91-51db7bca.jpg',
    'title': 'Жизнь взаймы',
    'author': 'Эрих Мария Ремарк',
    'description': 'ЖИЗНЬ ВЗАЙМЫ - это жизнь, которую герои отвоевывают у смерти. Когда терять уже нечего, когда один стоит на краю гибели, так эту жизнь и не узнав, а другому эта треклятая жизнь стала невыносима. И как всегда у Ремарка, только любовь и...',
    'id': 33
}, {
    'src': '/images/w91/w91-6d734baa.jpg',
    'title': 'Гарри Поттер и философский камень',
    'author': 'Джоан К. Роулинг',
    'description': 'Самая знаменитая сага новейшего времени разошлась рекордным тиражом - более 400 миллионов экземпляров на 68 языках (включая эсперанто, древнегреческий и латынь). Книги Роулинг сумели оторвать детей и взрослых от экранов компьютеров и...',
    'id': 34
}, {
    'src': '/images/w91/w91-b86dab42.jpg',
    'title': 'Война и мир',
    'author': 'Лев Толстой',
    'description': '"Война и мир" - самый знаменитый роман русской литературы. Действие начинается в России 1805 года, а затем автор описывает войну 1812 года и послевоенное время. Параллельно с военными событиями фильм освещает различные стороны светской...',
    'id': 35
}, {
    'src': '/images/w91/w91-49bc6983.jpg',
    'title': 'Игра престолов',
    'author': 'Джордж Р. Р. Мартин',
    'description': 'Эпическая, чеканная сага о мире Семи Королевств. О мире суровых земель вечного холода и радостных земель вечного лета. Мире лордов и героев, воинов и магов, чернокнижников и убийц - всех, кого свела воедино Судьба во исполнение древнего...',
    'id': 36
}, {
    'src': '/images/w91/w91-8fcc1e76.jpg',
    'title': 'Братья Карамазовы',
    'author': 'Федор Михайлович Достоевский',
    'description': '"Братья Карамазовы" - последнее большое произведение великого русского писателя Ф.М.Достоевского, в котором обнажены "все глубины души человеческой" и "дьявол с Богом борется, а поле битвы - сердца людей". В романе три главных героя:...',
    'id': 37
}, {
    'src': '/images/w91/w91-c3dde775.jpg',
    'title': 'Зелёная миля',
    'author': 'Стивен Кинг',
    'description': 'Стивен Кинг приглашает читателей в жуткий мир тюремного блока смертников, откуда уходят, чтобы не вернуться, приоткрывает дверь последнего пристанища тех, кто преступил не только человеческий, но и Божий закон. По эту сторону...',
    'id': 38
}, {
    'src': '/images/w91/w91-7b778136.jpg',
    'title': 'Гарри Поттер и орден феникса',
    'author': 'Джоан К. Роулинг',
    'description': '«Ты воспринимаешь мысли и эмоции Черного Лорда. Директор считает, что это следует прекратить. Он пожелал, чтобы я научил тебя блокировать сознание».  \n                                    В «Хогварце» настали темные времена. После того как дементоры напали на его кузена...',
    'id': 39
}, {
    'src': '/images/w91/w91-e8a0b2c2.jpg',
    'title': 'О дивный новый мир',
    'author': 'Олдос Хаксли',
    'description': '«О дивный новый мир » – культовая антиутопия Олдоса Хаксли, изданная миллионными тиражами по всему миру. \n                                    Роман о генетически программируемом «обществе потребления», «обществе всеобщего счастья», в котором разворачивается трагическая...',
    'id': 40
}, {
    'src': '/images/w91/w91-39a6a32c.jpg',
    'title': 'Понедельник начинается в субботу',
    'author': 'Аркадий Стругацкий',
    'description': 'Знаменитый роман братьев Стругацких "Понедельник начинается в субботу" - буквально раздерганная на цитаты история веселых, остроумных сотрудников таинственного института НИИЧАВО, где вполне всерьез занимаются исследованием магии и...',
    'id': 41
}, {
    'src': '/images/w91/w91-242a7d4c.jpg',
    'title': 'Жутко громко и запредельно близко',
    'author': 'Джонатан Сафран Фоер',
    'description': 'Роман Фоера "Жутко громко и запредельно близко" - это трогательная, глубокая, искренняя и щемящая сердце история, рассказанная 9-летним мальчиком, отец которого погиб в одной из башен-близнецов 11 сентября 2001 года. Мировая премьера...',
    'id': 42
}, {
    'src': '/images/w91/w91-8974f98a.jpg',
    'title': 'Парфюмер. История одного убийцы',
    'author': 'Патрик Зюскинд',
    'description': 'Блистательный и загадочный "Парфюмер" Патрика Зюскинда был впервые напечатан в Швейцарии в 1985 году. Сегодня он признан самым знаменитым романом, написанным в немецком языке со времен "На Западном фронте без перемен" Ремарка, издан...',
    'id': 43
}, {
    'src': '/images/w91/w91-7170c95a.jpg',
    'title': 'Унесенные ветром',
    'author': 'Маргарет Митчелл',
    'description': '«Унесенные ветром» — единственный роман Маргарет Митчелл, за который она — писательница, эмансипе и защитница прав женщин — получила Пулитцеровскую премию. Это книга о том, что заставляет нас жить и бороться — что бы ни творилось вокруг....',
    'id': 44
}, {
    'src': '/images/w91/w91-17816920.jpg',
    'title': 'Битва королей',
    'author': 'Джордж Р. Р. Мартин',
    'description': 'Джордж Мартин - "живой классик" мировой фантастики, талантливейший из современных мастеров фэнтези, чьи произведения удостоены самых высоких наград жанра. Его шедевром по праву считается эпопея "Песнь льда и огня" - величайшая...',
    'id': 45
}, {
    'src': '/images/w91/w91-f3a5caa9.jpg',
    'title': 'Гарри Поттер и кубок огня',
    'author': 'Джоан К. Роулинг',
    'description': '«Испытаний на протяжении этого учебного года будет три, и они позволят проверить способности чемпионов с разных сторон… колдовское мастерство – доблесть – способность к дедукции – и, разумеется, умение достойно встретить опасность».  \n                                    В...',
    'id': 46
}, {
    'src': '/images/w91/w91-d28a62a6.jpg',
    'title': 'Мёртвые души',
    'author': 'Николай Васильевич Гоголь',
    'description': '«Мёртвые ду́ши» — произведение писателя Николая Васильевича Гоголя, жанр которого сам автор обозначил как поэма. \n                                    Авантюрист Чичиков скупает «мертвые души» — почивших крепостных, учтенных в качестве живых при последней ревизии. Помещики...',
    'id': 47
}, {
    'src': '/images/w91/w91-621b9b25.jpg',
    'title': 'Гарри Поттер и тайная комната',
    'author': 'Джоан К. Роулинг',
    'description': '«Заговор, Гарри Поттер. Заговор – в этом году в Хогвартсе, школе колдовства и ведьминских искусств, произойдут ужаснейшие события».  \n                                    Лето у Гарри Поттера состояло из самого ужасного дня рождения в жизни, мрачных предупреждений от...',
    'id': 48
}, {
    'src': '/images/w91/w91-59b46752.jpg',
    'title': 'Трудно быть богом',
    'author': 'Аркадий Стругацкий',
    'description': '«Трудно быть богом» — научно-фантастическая повесть Аркадия и Бориса Стругацких. \n                                    Ученый с Земли далекого и светлого будущего заброшен на планету, живущую по средневековым законам, под видом местного аристократа Руматы Эсторского. Его...',
    'id': 49
}, {
    'src': '/images/w91/w91-78feae66.jpg',
    'title': 'Собачье сердце',
    'author': 'Михаил Афанасьевич Булгаков',
    'description': '«Собачье сердце» – одно из самых любимых читателями произведений Михаила Булгакова. Рассказ о необыкновенном эксперименте гениального доктора. \n                                    Москва, 1924 год. Профессор Филипп Филиппович Преображенский, выдающийся хирург, достиг...',
    'id': 50
}, {
    'src': '/images/w91/w91-b1ad0115.jpg',
    'title': 'Гарри Поттер и узник Азкабана',
    'author': 'Джоан К. Роулинг',
    'description': '«Добро пожаловать в «ГрандУлет», спасательный экипаж для колдунов и ведьм, оказавшихся в затруднительном положении. Выставите палочку, взойдите на борт, и мы отвезем вас куда пожелаете».  \n                                    Когда из темноты с грохотом появляется...',
    'id': 51
}, {
    'src': '/images/w91/w91-c8da961c.jpg',
    'title': 'Тринадцатая сказка',
    'author': 'Диана Сеттерфилд',
    'description': 'Маргарет Ли работает в букинистической лавке своего отца. Современности она предпочитает Диккенса и сестер Бронте. Тем больше удивление Маргарет, когда она получает от самой знаменитой писательницы наших дней Виды Винтер предложение стать...',
    'id': 52
}, {
    'src': '/images/w91/w91-4f12afe6.jpg',
    'title': 'На Западном фронте без перемен',
    'author': 'Эрих Мария Ремарк',
    'description': 'Их вырвали из привычной жизни... Их швырнули в кровавую грязь войны... Когда-то они были юношами, учившимися жить и мыслить. Теперь они - пушечное мясо. Солдаты. Тысячи и тысячи навеки лягут на полях Первой мировой. Тысячи и тысячи...',
    'id': 53
}, {
    'src': '/images/w91/w91-9b17e259.jpg',
    'title': 'Источник',
    'author': 'Айн  Рэнд',
    'description': 'Главные герои романа - архитектор Говард Рорк и журналистка Доминик Франкон - отстаивают свободу творческой личности в борьбе с обществом, где ценят "равные возможности" для всех. Вместе и поодиночке, друг с другом и друг против друга, но...',
    'id': 54
}, {
    'src': '/images/w91/w91-69b8810c.jpg',
    'title': 'Властелин Колец',
    'author': 'Джон Рональд Руэл Толкин',
    'description': '"Властелин Колец" — роман-эпопея английского писателя Дж. Р. Р. Толкина, самое известное произведение жанра фэнтези.\n                                    Сказания о Средиземье — это хроника Великой войны за Кольцо, войны, длившейся не одну тысячу лет. Тот, кто владел...',
    'id': 55
}, {
    'src': '/images/w91/w91-1af69020.jpg',
    'title': 'Над кукушкиным гнездом',
    'author': 'Кен Кизи',
    'description': '"Над кукушкиным гнездом" К.Кизи - история о бунте героя против тирании, попытки пробудить в больных психиатрической больницы чувство собственного достоинства.\n                                    Сымитировав помешательство в надежде избежать тюремного заключения, Рэндл...',
    'id': 56
}, {
    'src': '/images/w91/w91-c9b5ef9b.jpg',
    'title': 'Доктор Живаго',
    'author': 'Борис Пастернак',
    'description': 'Широко известный роман выдающегося поэта и прозаика XX века. Трагическая судьба его героя, слившись с судьбой самого автора, стала символом поколения, к которому они оба принадлежали. \n                                    Это роман о любви, о России, о русской...',
    'id': 57
}, {
    'src': '/images/w91/w91-ee9ef4f2.jpg',
    'title': 'Золотой телёнок',
    'author': 'Евгений Петров',
    'description': 'Бешеный успех, который обрушился на Илью Ильфа и Евгения Петрова после публикации "Двенадцати стульев" (1928), побудил соавторов "воскресить"своего героя, неунывающего и обаятельного афериста Остапа Бендера, и взяться за создание романа...',
    'id': 58
}, {
    'src': '/images/w91/w91-8bde4371.jpg',
    'title': 'Мартин Иден',
    'author': 'Джек  Лондон',
    'description': '"Мартин Иден" - роман выдающегося американского писателя Джека Лондона о мечте и успехе.\n                                    В книге знаменитого американского писателя Джека Лондона "Мартин Иден" рacкpывaeтcя тeмa пcиxoлoгичecкoгo пpeoбpaзoвaния чeлoвeкa, в тяжeлыx...',
    'id': 59
}, {
    'src': '/images/w91/w91-6a18b563.jpg',
    'title': 'Волхв',
    'author': 'Джон  Фаулз',
    'description': '"Волхв" - самый популярный роман выдающегося английского писателя, известного в России книгами "Коллекционер", "Башня из черного дерева", "Женщина французского лейтенанта", "Дэниэл Мартин". На затерянном греческом острове загадочный "маг"...',
    'id': 60
}, {
    'src': '/images/w91/w91-e6c60f89.jpg',
    'title': 'Гарри Поттер и Дары Смерти',
    'author': 'Джоан К. Роулинг',
    'description': '«Отдайте мне Гарри Поттера, – сказал голос Вольдеморта, – и останетесь целы. Отдайте Гарри Поттера, и я не трону замок. Отдайте Гарри Поттера, и будете вознаграждены».  \n                                    Забираясь в коляску мотоцикла Огрида и взмывая в небо, чтобы больше...',
    'id': 61
}, {
    'src': '/images/w91/w91-dd2d858e.jpg',
    'title': 'Волшебник Изумрудного города',
    'author': 'Александр Мелентьевич Волков',
    'description': '«Волшебник Изумрудного города» — сказочная повесть Александра Мелентьевича Волкова, написанная в 1939 году на основе сказки Фрэнка Баума «Удивительный волшебник из страны Оз» (англ. The Wonderful Wizard of Oz) с некоторыми...',
    'id': 62
}, {
    'src': '/images/w91/w91-b80f8cc1.jpg',
    'title': 'Гарри Поттер и принц-полукровка',
    'author': 'Джоан К. Роулинг',
    'description': '«Над школой висел светящийся зеленый череп с языком-змеей, знак Упивающихся Смертью… знак, который они оставляют… когда убивают кого-то…»  \n                                    Когда однажды летней ночью Думбльдор прибывает на Бирючинную улицу, чтобы забрать Гарри, мальчик...',
    'id': 63
}, {
    'src': '/images/w91/w91-0fc2c5d0.jpg',
    'title': 'Алые паруса',
    'author': 'Александр Грин',
    'description': 'Творчество Александра Грина - уникально для русской литературы. Его романтические произведения долгое время не признавались критикой, но всегда привлекали читателей. Его герои - исключительные натуры, которые способны делать чудеса...',
    'id': 64
}, {
    'src': '/images/w91/w91-3f161ad2.jpg',
    'title': 'Крестный отец',
    'author': 'Марио Пьюзо',
    'description': '«Крестный отец» – классический роман о жизни одного из могущественных преступных синдикатов Америки – мафиозного клана дона Корлеоне. Написанный с потрясающей достоверностью, он позволяет читателю без риска для жизни заглянуть в святая...',
    'id': 65
}, {
    'src': '/images/w91/w91-00742e9c.jpg',
    'title': 'Код да Винчи',
    'author': 'Дэн Браун',
    'description': 'Секретный код скрыт в работах Леонардо да Винчи… Только он поможет найти христианские святыни, дававшие немыслимые власть и могущество… Ключ к величайшей тайне, над которой человечество билось веками, может быть найден… В романе «Код да...',
    'id': 66
}, {
    'src': '/images/w91/w91-14c5ad20.jpg',
    'title': 'Облачный атлас',
    'author': 'Дэвид Митчелл',
    'description': 'ОБЛАЧНЫЙ АТЛАС подобен зеркальному лабиринту, в котором перекликаются, наслаиваясь друг на друга, шесть голосов: нотариуса середины девятнадцатого века, возвращающегося в США из Австралии; молодого композитора, вынужденного торговать...',
    'id': 67
}, {
    'src': '/images/w91/w91-3f80ca10.jpg',
    'title': 'Норвежский лес',
    'author': 'Харуки Мураками',
    'description': '…по вечерам я продавал пластинки. А в промежутках рассеянно наблюдал за публикой, проходившей перед витриной. Семьи, парочки, пьяные, якудзы, оживленные девицы в мини-юбках, парни с битницкими бородками, хостессы из баров и другие...',
    'id': 68
}, {
    'src': '/images/w91/w91-63fb4420.jpg',
    'title': 'Горе от ума',
    'author': 'А. С. Грибоедов',
    'description': '«Горе от ума» — комедия в стихах А. С. Грибоедова — произведение, сделавшее своего создателя классиком русской литературы. \n                                    Комедия «Горе от ума» — сатира на аристократическое московское общество первой половины XIX века — одна из вершин...',
    'id': 69
}, {
    'src': '/images/w91/w91-3fe6383e.jpg',
    'title': 'Повелитель мух',
    'author': 'Уильям Голдинг',
    'description': '«Повелитель мух» – жемчужина творческого наследия Уильяма Голдинга. Гротескная антиутопия, "черная робинзонада" и роман-предупреждение... \n                                    «Повелитель мух» — дебютный аллегорический роман английского писателя, лауреата Нобелевской премии...',
    'id': 70
}, {
    'src': '/images/w91/w91-0a898253.jpg',
    'title': 'Джейн Эйр',
    'author': 'Шарлотта Бронте',
    'description': 'Готическое поместье, любовь, покушение на убийство, сумасшедшая супруга главного героя, запертая на чердаке, - в самом известном романе Шарлотты Бронте ДЖЕЙН ЭЙР. \n                                    Викторианская Англия. После восьми лет, проведенных в пансионе для бедных...',
    'id': 71
}, {
    'src': '/images/w91/w91-ec84586a.jpg',
    'title': 'Скотный Двор',
    'author': 'Джордж Оруэлл',
    'description': '"Все животные равны, но некоторые животные равнее других" - это, наверное, самая знаменитая фраза из классической притчи Джорджа Оруэлла о крушении революционных надежд. Трагический смысл "Скотный двор" проступает сквозь яркий пародийный...',
    'id': 72
}, {
    'src': '/images/w91/w91-ac066404.jpg',
    'title': 'Географ глобус пропил',
    'author': 'Алексей Иванов',
    'description': 'Прозаик Алексей Иванов с раннего детства живет в Перми; автор романов "Общага-на-Крови", "Блуда и МУДО", "Сердце пармы", "Золото бунта", а так же историко-публицистических книг, среди которых "Хребет России", "Message: Чусовая", "Увидеть...',
    'id': 73
}, {
    'src': '/images/w91/w91-0c8313ac.jpg',
    'title': 'Хоббит, или Туда и обратно',
    'author': 'Джон Рональд Руэл Толкин',
    'description': 'Волшебная сказка известного английского писателя Дж.Толкина "Хоббит" рассказывает об увлекательном и опасном путешествии хоббита Бильбо Торбинса и его друзей-гномов за сокровищами предков.\n                                    Это рассказ о путешествии хоббита Бильбо...',
    'id': 74
}, {
    'src': '/images/w91/w91-4023faac.jpg',
    'title': 'Царь всех болезней. Биография рака',
    'author': 'Сиддхартха Мукерджи',
    'description': 'Книга "Царь всех болезней. Биография рака" переведена на 33 языка и удостоена:\n                                    - Пулитцеровской премии\n                                    - Премии Пен-клуба как лучшее научно-популярное произведение\n                                    - Премии за исследования в области онкологии\n                                    - Премии "New York Times" как...',
    'id': 75
}, {
    'src': '/images/w91/w91-01b4364a.jpg',
    'title': 'Поющие в терновнике',
    'author': 'Колин Маккалоу',
    'description': 'Роман современной американской писательницы, уроженки Австралии. Колин Маккалоу "Поющие в терновнике" (1977) - романтическая сага о трех поколениях австралийских тружеников, о людях, трудно ищущих свое счастье. Воспевающая чувства сильные...',
    'id': 76
}, {
    'src': '/images/w91/w91-8f69176c.jpg',
    'title': 'Старик и море',
    'author': 'Эрнест Хемингуэй',
    'description': 'Повесть «Старик и море» написана Э.Хемингуэем в 1952 году. За нее известный американский писатель был удостоен Нобелевской премии.\n                                    Повесть посвящена "трагическому стоицизму": перед жестокостью мира человек, даже проигрывая, должен...',
    'id': 77
}, {
    'src': '/images/w91/w91-00dce01d.jpg',
    'title': 'Буря мечей',
    'author': 'Джордж Р. Р. Мартин',
    'description': '"Песнь льда и огня". Эпическая, чеканная сага о мире Семи Королевств. О мире суровых земель вечного холода и радостных земель вечного лета. Мире опасных приключений, тончайших политических интриг и великих деяний. Мире лордов и героев,...',
    'id': 78
}, {
    'src': '/images/w91/w91-66a7a1a4.jpg',
    'title': 'Фауст',
    'author': 'Иоганн Вольфганг Гете',
    'description': '«Фауст» - бессмертная трагедия И. В. Гете. Сюжет взят из народной немецкой книги о докторе-алхимике. Иоганн Фауст жил в XVI веке, слыл магом и чернокнижником и, отвергнув современную науку и религию, продал душу дьяволу. О докторе Фаусте...',
    'id': 79
}, {
    'src': '/images/w91/w91-76d89848.jpg',
    'title': 'Инферно',
    'author': 'Дэн Браун',
    'description': '…Оказавшись в самом загадочном городе Италии – Флоренции, профессор Лэнгдон, специалист по кодам, символам и истории искусства, неожиданно попадает в водоворот событий, которые способны привести к гибели все человечество. И помешать этому...',
    'id': 80
}, {
    'src': '/images/w91/w91-2c766cd5.jpg',
    'title': 'Лолита',
    'author': 'Владимир Набоков',
    'description': 'В 1955 году увидела свет ЛОЛИТА - третий американский роман Владимира Набокова, создателя "Защиты Лужина", "Отчаяния", "Приглашения на казнь" и "Дара". Вызвав скандал по обе стороны океана, эта книга вознесла автора на вершину...',
    'id': 81
}, {
    'src': '/images/w91/w91-20bbfa18.jpg',
    'title': 'Отверженные',
    'author': 'Виктор Гюго',
    'description': 'Роман-эпопея Виктора Гюго "Отверженные" (1862) — огромный текст, без которого невозможно представить себе духовную историю XIX века. В сущности, это "война и мир" великого французского классика, только здесь находит отражение не...',
    'id': 82
}, {
    'src': '/images/w91/w91-ebe9b2a6.jpg',
    'title': '11/22/63',
    'author': 'Стивен Кинг',
    'description': 'Джейк Эппинг, тридцатипятилетний учитель английского языка средней школы города Лизбон-Фоллс в штате Мэн, который с целью заработка денег проводит дополнительные уроки по подготовке к сдаче выпускных тестов для взрослых, получает от...',
    'id': 83
}, {
    'src': '/images/w91/w91-d8fc7794.jpg',
    'title': 'Сказать жизни «Да!»: психолог в концлагере',
    'author': 'Виктор Франкл',
    'description': 'Эта удивительная книга сделала ее автора одним из величайших духовных учителей человечества в XX веке. В ней философ и психолог Виктор Франкл, прошедший нацистские лагеря смерти, открыл миллионам людей всего мира путь постижения смысла...',
    'id': 84
}, {
    'src': '/images/w91/w91-19688f22.jpg',
    'title': 'Автостопом по Галактике',
    'author': 'Дуглас Адамс',
    'description': '«Автостопом по галактике» (англ. The Hitchhiker’s Guide to the Galaxy; более дословные переводы: Путеводитель автостопщика по галактике, Путеводитель для путешествующих по галактике автостопом) — серия сатирических научно-фантастических...',
    'id': 85
}, {
    'src': '/images/w91/w91-1a2c0c03.jpg',
    'title': 'Пикник на обочине',
    'author': 'Аркадий Стругацкий',
    'description': 'Одно из самых прославленных произведений братьев Стругацких - роман ПИКНИК НА ОБОЧИНЕ, увлекательная история сталкеров - отчаянно смелых людей, на свой страх и риск снова и снова отправляющихся в место высадки пришельцев - аномальную...',
    'id': 86
}, {
    'src': '/images/w91/w91-608e5555.jpg',
    'title': 'Приключения Шерлока Холмса',
    'author': 'Артур Конан Дойл',
    'description': 'В настоящую книгу Артура Конан Дойла вошли его ранние рассказы и повести о знаменитом сыщике Шерлоке Холмсе: "Голубой карбункул", "Желтое лицо", "Приключения клерка", "Глория Скотт" и другие.',
    'id': 87
}, {
    'src': '/images/w91/w91-2a9393fd.jpg',
    'title': 'Аэропорт',
    'author': 'Артур Хейли',
    'description': 'Роман известного американского писателя А.Хейли "Аэропорт" воссоздает атмосферу работы крупного административно-производственного комплекса. Книга привлекает внимание достоверностью и живостью описаний, доскональным знанием материала,...',
    'id': 88
}, {
    'src': '/images/w91/w91-dcbcf620.jpg',
    'title': 'Элегантность ёжика',
    'author': 'Мюриэль Барбери',
    'description': '«Элегантность ежика», второй роман французской писательницы Мюриель Барбери (р. 1969), прославил ее имя не только во Франции, но и во многих других странах. Мюриель страстно влюблена в творчество Л. Н. Толстого и культуру Японии, и обе...',
    'id': 89
}, {
    'src': '/images/w91/w91-2d76b0be.jpg',
    'title': 'Стив Джобс',
    'author': 'Уолтер Айзексон',
    'description': 'В основу этой биографии легли беседы с самим Стивом Джобсом, а также с его родственниками, друзьями, врагами, соперниками и коллегами. Джобс никак не контролировал автора. Он откровенно отвечал на все вопросы и ждал такой же честности от...',
    'id': 90
}, {
    'src': '/images/w91/w91-cf0fa6de.jpg',
    'title': 'Виноваты звёзды',
    'author': 'Джон Грин',
    'description': 'О романе Этот роман поразил весь мир! В 2012 году он попал на первую строчку рейтингов, по версии Time, Entertainment Weekly, New York Times, Wall Street Journal,  Publishers Weekly и еще ВОСЬМИ периодических изданий! Пронзительная...',
    'id': 91
}, {
    'src': '/images/w91/w91-3d6fa636.jpg',
    'title': 'До встречи с тобой',
    'author': 'Джоджо Мойес',
    'description': 'Лу Кларк знает, сколько шагов от автобусной остановки до ее дома. Она знает, что ей очень нравится работа в кафе и что, скорее всего, она не любит своего бойфренда Патрика. Но Лу не знает, что вот-вот потеряет свою работу и что в...',
    'id': 92
}, {
    'src': '/images/w91/w91-2bee2690.jpg',
    'title': 'Обломов',
    'author': 'Иван Гончаров',
    'description': 'Один из известнейших романов И.А.Гончарова (1812-1891) "Обломов".\n                                    Когда в 1859 году вышел в свет роман И.А.Гончарова "Обломов", читатели вряд ли догадывались, что держат в руках одну из "краеугольных" русских книг.\n                                    Гончаров не только...',
    'id': 93
}, {
    'src': '/images/w91/w91-ffbf954e.jpg',
    'title': 'Собака Баскервилей',
    'author': 'Артур Конан Дойл',
    'description': 'Повесть Артура Конан Дойля "Собака Баскервилей" была написана в 1902 году и продолжила цикл повестей и рассказов, объединенных общим героем - гениальным сыщиком Шерлоком Холмсом. ...К Шерлоку Холмсу обращается доктор Джеймс Мортимер,...',
    'id': 94
}, {
    'src': '/images/w91/w91-02bbb06f.jpg',
    'title': 'Похороните меня за плинтусом',
    'author': 'Павел Санаев',
    'description': 'Книга, номинированная на Букеровскую премию, буквально взорвала отечественный книжный рынок и обрела не просто культовый, но - легендарный статус! Повесть, в которой тема взросления будто переворачивается с ног на голову и обретает черты...',
    'id': 95
}, {
    'src': '/images/w91/w91-1b5b1c15.jpg',
    'title': 'Праздник, который всегда с тобой',
    'author': 'Эрнест Хемингуэй',
    'description': 'Париж "веселых двадцатых"...\n                                    Город, вдохновивший сотни писателей, актеров, художников, слетевшихся сюда из разных уголков мира...\n                                    Завораживающая, полная драматизма и романтических безумств жизнь международной богемы...\n                                    Это - "Праздник,...',
    'id': 96
}, {
    'src': '/images/w91/w91-7f143ea0.jpg',
    'title': 'Дары волхвов',
    'author': 'О` Генри',
    'description': '"Дары волхвов" - удивительно добрый и светлый рассказ о двух взрослых детях, не утративших веру в чудеса. Двое влюбленных и самый сердечный праздник – Рождество, которое они готовятся встретить вместе. Сентиментальная новелла впервые была...',
    'id': 97
}, {
    'src': '/images/w91/w91-0fe836b5.jpg',
    'title': 'Трое в лодке, не считая собаки',
    'author': 'Джером Клапка Джером',
    'description': 'Однажды трое приятелей-холостяков, лондонских жителей, решили сделаться ближе к природе и отправиться в лодочное путешествие по Темзе, прихватив с собой собачку Монморенси… Классика английского юмора, разобранная на цитаты.',
    'id': 98
}, {
    'src': '/images/w91/w91-8867894c.jpg',
    'title': 'Трилогия Крысы',
    'author': 'Харуки Мураками',
    'description': 'Так получилось у Харуки Мураками, что в "Трилогию Крысы" входят четыре романа. Не удивляйтесь, все правильно! "Слушай песню ветра " и "Пинбол" - два первых романа знаменитого цикла писателя, завершающегося "Охотой на овец" и продолженного...',
    'id': 99
}, {
    'src': '/images/w91/w91-22ff9b20.jpg',
    'title': 'Чапаев и пустота',
    'author': 'Виктор Пелевин',
    'description': 'Роман "Чапаев и Пустота" сам автор характеризует так: "Это первое произведение в мировой литературе, действие которого происходит в абсолютной пустоте". На самом деле оно происходит в 1919 году в дивизии Чапаева, в которой главный герои,...',
    'id': 100
}];

export const bookList = books;

export const findBookById = (searchedId) => bookList.find(({id}) => id == searchedId);

export const findBooksByAuthor = (searchedAuthors) => bookList.filter(({author}) => author === searchedAuthors);

export default {bookList, findBookById, findBooksByAuthor};
