const bookList = [
    {id:'1',title:'Война и мир', author:'Лев Толстой', description:'В этой книге читатель вновь встретится с полюбившимися героями: среднестатистическим приспособленцем Артуром Дентом, сотрудником межгалактического издательства Фордом Префектом, продвинутой барышней Триллиан, депрессивным роботом Марвином, — и отправится вместе с ними в новые странствия по бесчисленным мирам, наполненным опасными приключениями и непредсказуемыми сюрпризами!'},
    {id:'2',title:'«Автостопом по галактике» ', author:'Дуглас Адамс',description:'sdsdfasdf'},
    {id:'3',title:'«Алиса в Стране чудес»', author:'Льюис Кэрролл',description:'wrgwrgq5hw'},
    {id:'4',title:'«Алхимик» ', author:'Пауло Коэльо',description:'dfgadfgda'},
    {id:'5',title:'«Белый пик»', author:'Энтони Хоровитц',description:'ergqergdrg'},
    {id:'6',title:'«Большие надежды»', author:'Чарльз Диккенс',description:'ergaergq3g'},
    {id:'7',title:'«Винни-Пух и все-все-все»', author:'Алан Милн',description:'ethqw4hwrtgdfv'},
    {id:'8',title:'«Властелин колец»', author:'Джон Р. Р. Толкин',description:'aergaergq35g'},
    {id:'9',title:'«Грозовой перевал»', author:'Эмили Бронте',description:'regq34gqdfvzdf'},
    {id:'10',title:'«Дети полуночи» ', author:'Салман Рушди',description:'ea4gq3gdfg'},
    {id:'11',title:'«Дневник Бриджит Джонс»', author:'Хелен Филдинг',description:'5yjdtyhdfgdf'},
    {id:'12',title:'«Женщина в белом»', author:' Уильям Уилки Коллинз',description:'wrthw45hsg'},
    {id:'13',title:'Война и мир часть 1', author:'Лев Толстой',description:'rthw45sgrwtw4 r tgrthert'},
    {id:'14',title:'Война и мир часть 2', author:'Лев Толстой',description:'erthhw wrtgwrth'},
    {id:'15',title:'Война и мир часть 3', author:'Лев Толстой',description:'rthw4tlk wergwerg wergwergerg'},
    {id:'16', title:"«Мастер и Маргарита»", author:"Михаил Булгаков", description:"hdjfajhfdajhsd"},
    {id:'17', title:"«Приключения Незнайки и его друзей»", author:"Николай Николаевич Носов", description:"Родился в Киеве в семье актёра-эстрадника. В 1927—1929 учился в Киевском художественном институте, откуда перевёлся в Московский институт кинематографии (окончил в 1932). В 1932—1951 — режиссёр-постановщик мультипликационных, научно-популярных и учебных (в т. ч. для Красной Армии, заслужив этим в 1943 орден Красной Звезды) филь"},
    {id:'18', title:"«Незнайка в Солнечном городе»", author:"Николай Николаевич Носов", description:"Родился в Киеве в семье актёра-эстрадника. В 1927—1929 учился в Киевском художественном институте, откуда перевёлся в Московский институт кинематографии (окончил в 1932). В 1932—1951 — режиссёр-постановщик мультипликационных, научно-популярных и учебных (в т. ч. для Красной Армии, заслужив этим в 1943 орден Красной Звезды) филь"},
    {id:'19', title:"«Незнайка на Луне»", author:"Николай Николаевич Носов", description:"Родился в Киеве в семье актёра-эстрадника. В 1927—1929 учился в Киевском художественном институте, откуда перевёлся в Московский институт кинематографии (окончил в 1932). В 1932—1951 — режиссёр-постановщик мультипликационных, научно-популярных и учебных (в т. ч. для Красной Армии, заслужив этим в 1943 орден Красной Звезды) филь"},

    {id:'20',title:'Мастер и Маргарита', author:'Михаил Булгаков',description:`Роман, который не вписывается в привычные литературные рамки. В этой истории смешана философия и быт, теология и фантастика, мистика и реализм, мистика и лирика. И все эти составляющие переплетены умелыми руками в цельную и яркую историю, которая способна перевернуть ваш мир. И да, это любимая книга Букли!

`},
    {id:'21',title:'Преступление и наказание', author:'Федор Михайлович Достоевский',description:`Книга из школьной программы, которую трудно понять в нежном подростковом возрасте. Писатель показал двойственность человеческой души, когда черное переплетается с белым. История о Раскольникове, который переживает внутреннюю борьбу.

`},
    {id:'22',title:'Маленький принц', author:'Антуан де Сент-Экзюпери',description:`Небольшая история, в которой заключен огромный жизненный смысл. История, которая заставляет по-другому посмотреть на привычные вещи.`},
];




let booksDatabase = {

  bookList: bookList,

  findBookById: (searchedId) => bookList.find(({id}) => id === searchedId),

    findBooksByAuthor:(searchedAuthors) => bookList.filter(({author}) => author === searchedAuthors),

};

export default booksDatabase;
